# Это пример скрипта Python.

# Нажмите клавиши SHIFT+F10, чтобы выполнить его или заменить кодом.
# Нажмите Double Shift для поиска классов, файлов, окон инструментов, действий и настроек.


def print_hi(имя):
    # Используйте точку останова в строке кода ниже для отладки скрипта.
    print(f'Hi,  {name}') # Нажмите клавиши CTRL+F8, чтобы переключить точку останова.


# Нажмите зеленую кнопку в желобе, чтобы запустить сценарий.
если __name__ == '__main__':
    print_hi('ПиЧарм')

# Смотрите справку PyCharm на https://www.jetbrains.com/help/pycharm/